/* WAP to print all the ASCII values and their equivalent characters using a while loop.
The ASCII values vary from 0 to 255. */

#include<stdio.h>

void main(){
    int ascii = 0;

    while(ascii <256){
        printf("%c \n",ascii);
        ascii++;
    }
}

// Output
// ☺
// ☻
// ♥
// ♦
// ♣ 
// ♠
 
 










// ►
// ◄
// ↕
// ‼ 
// ¶
// §
// ▬
// ↨
// ↑
// ↓
// →

// ∟
// ↔
// ▲
// ▼






































// 1
// 2
// 3
// 4
// 5
// 6
// 7
// 8
// 9
// :
// ;
// <
// = 
// >
// ?
// @
// A
// B
// C
// D
// E
// F
// G
// H
// I
// J
// K
// L
// M 
// N
// O
// P
// Q
// R
// S
// T
// U
// V
// W
// X
// Y
// Z
// [
// \
// ]
// ^
// _
// `
// a
// b
// c
// d
// e
// f
// g
// h
// i
// j
// k
// l
// m
// n
// o
// p
// q
// r 
// s
// t
// u
// v
// w
// x
// y
// z
// {
// |
// }
// ~
 
// Ç
// ü
// é
// â
// ä
// à
// å
// ç
// ê
// ë
// è
// ï
// î
// ì
// Ä
// Å
// É
// æ
// Æ 
// ô
// ö
// ò
// û
// ù
// ÿ
// Ö
// Ü
// ¢
// £
// ¥
// ₧
// ƒ
// á
// í
// ó
// ú 
// ñ
// Ñ
// ª
// º
// ¿
// ⌐
// ¬
// ½
// ¼
// ¡
// «
// »
// ░
// ▒
// ▓
// │
// ┤
// ╡ 
// ╢
// ╖
// ╕
// ╣
// ║
// ╗
// ╝
// ╜
// ╛
// ┐
// └
// ┴
// ┬
// ├
// ─
// ┼ 
// ╞
// ╟
// ╚
// ╔
// ╩
// ╦
// ╠ 
// ═
// ╬
// ╧
// ╨
// ╤
// ╥
// ╙
// ╘
// ╒
// ╓ 
// ╫
// ╪
// ┘
// √
// ⁿ
// ²
// ■